package main

/* META
#7. Упорядоченный список
#6 Регулярная задача
Переделайте функцию поиска с учётом признака упорядоченности и возможности раннего прерывания поиска,
если найден заведомо больший или меньший элемент, нежели искомый (то есть значение по сути не найдено). Оцените сложность операции поиска, изменилась ли она?

WIP

Рефлексия к задаче:
	WIP
*/

/* META
#7. Упорядоченный список
#8 Дополнительная задача
Добавьте метод удаления всех дубликатов из упорядоченного списка.

WIP

Рефлексия к задаче:
	WIP
*/

/* META
#7. Упорядоченный список
#9 Напишите алгоритм слияния двух упорядоченных списков в один, сохраняя порядок элементов. Подумайте, как это сделать наиболее эффективно.

WIP

Рефлексия к задаче:
	WIP
*/

/* META
#7. Упорядоченный список
#10 Напишите метод проверки наличия заданного упорядоченного под-списка (параметр метода) в текущем списке.

WIP

Рефлексия к задаче:
	WIP
*/

/* META
#7. Упорядоченный список
#11 Добавьте метод, который находит наиболее часто встречающееся значение в списке.

WIP

Рефлексия к задаче:
	WIP
*/

/* META
#7. Упорядоченный список
#12 Добавьте в упорядоченный список возможность найти индекс элемента (параметр) в списке, которая должна работать за O(log N). Внутреннюю реализацию списка для этого можно сменить.

WIP

Рефлексия к задаче:
	WIP
*/