package main

/* META
#11. Фильтр Блюма
#2 Дополнительная задача
Напишите алгоритм слияния нескольких фильтров Блюма (одинакового размера и с одинаковым набором хэш-функций).
Как изменится вероятность ложного срабатывания для итогового фильтра?

WIP

Рефлексия к задаче:
	WIP
*/

/* META
#11. Фильтр Блюма
#3 Дополнительная задача
Реализуйте фильтр Блюма, предусматривающий удаление элементов 

WIP

Рефлексия к задаче:
	WIP
*/

/* META
#11. Фильтр Блюма
#4 Дополнительная задача

WIP

Рефлексия к задаче:
	WIP
*/