package main

/* META
#10. Множества
#4 Дополнительная задача
Добавьте метод, реализующий декартово произведение множеств. Возвращайте множество из пар соответствий.

WIP

Рефлексия к задаче:
	WIP
*/

/* META
#10. Множества
#5 Дополнительная задача
Напишите функцию, которая находит пересечение любых трёх и более множеств (принимает количество множеств >= 3 в качестве списка).

WIP

Рефлексия к задаче:
	WIP
*/

/* META
#10. Множества
#6 Дополнительная задача
Реализуйте мульти-множество (Bag), в котором каждый элемент может присутствовать несколько раз. Добавьте методы добавления элементов, удаления одного экземпляра элемента и получения списка всех элементов с их частотами (сколько раз встречаются).

WIP

Рефлексия к задаче:
	WIP
*/